html/thinking_in_systems_a_primer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-16 Sat 01:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thinking in Systems: A Primer</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<header>
    <script src="setup-initial-theme.js"></script>
    <div style="display: flex; flex-direction: row; justify-content: space-between; align-items: center;">
        <a style="color: inherit; text-decoration: none" href="/">
            ketan agrawal
        </a>
        <div>
            <input type="checkbox" id="theme-switcher">
            <label id="theme-switcher-label" for="theme-switcher"></label>
        </div>
    </div>
</header>
</div>
<div id="content" class="content">
<h1 class="title">Thinking in Systems: A Primer
<br />
<span class="subtitle">Last modified on July 18, 2022</span>
</h1>

<div id="outline-container-org9e5c922" class="outline-2">
<h2 id="org9e5c922">Overall thoughts</h2>
<div class="outline-text-2" id="text-org9e5c922">
<p>
It&rsquo;s crazy how pervasive systems are in our universe, once you learn how to look for them. It&rsquo;s like they&rsquo;ve hiding in plain sight, but I just didn&rsquo;t have the proper <a href="private/20200227113959_framing.html#ID-bf96c1eb-3ce0-4d7a-b2ae-e44f2fbdf240">frames</a> to see them.<br />
</p>

<p>
This book inspires me to want to get more intuitions for the ways that complex systems work. (I mean, tbh, every person on this earth probably has intuition for a complex system, in one way or another. We come into contact with incredibly complex social, economic, psychological, and physical systems every day, and we have really good mental models of a <i>lot</i> of it. We can predict the future.) But I guess&#x2026;I want to go beyond the everyday intuitions that we have for systems that we know. I want to have intuitions for broad categories of systems, for the way that the world works.<br />
</p>

<p>
Are viruses complex systems? On its own, it seems that an individual virus is not very complex &#x2013; it&rsquo;s not super resilient, and it doesn&rsquo;t have an apparent hierarchy. but maybe it self-organizes, in that it reproduces&#x2026;and maybe if we see the evolution of viruses as a system, then that can be said to have more system-like properties&#x2026;e.g. it&rsquo;s resilient.<br />
</p>

<p>
The idea that resiliency != stasis really stuck with me.<br />
</p>
</div>
</div>
<div id="outline-container-orgb65fb6b" class="outline-2">
<h2 id="orgb65fb6b">Highlights/annotations</h2>
<div class="outline-text-2" id="text-orgb65fb6b">
</div>
<div id="outline-container-org98c7717" class="outline-3">
<h3 id="org98c7717">Introduction: The Systems Lens</h3>
<div class="outline-text-3" id="text-org98c7717">
</div>
<div id="outline-container-orgcd0f1ec" class="outline-4">
<h4 id="orgcd0f1ec">Highlight (yellow) - Page 1 · Location 157</h4>
<div class="outline-text-4" id="text-orgcd0f1ec">
<blockquote>
<p>
Managers are not confronted with problems that are independent of each other , but with dynamic situations that consist of complex <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">systems</a> of changing problems that interact with each other . I call such situations messes . … Managers do not solve problems , they manage messes .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org67ddd22" class="outline-4">
<h4 id="org67ddd22">Highlight (yellow) - Page 2 · Location 175</h4>
<div class="outline-text-4" id="text-org67ddd22">
<blockquote>
<p>
So , what is a <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">system</a> ? A system is a set of things — people , cells , molecules , or whatever — interconnected in such a way that they produce their own pattern of behavior over time . The system may be buffeted , constricted , triggered , or driven by outside forces . But the system’s response to these forces is characteristic of itself , and that response is seldom simple in the real world .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org6f35532" class="outline-4">
<h4 id="org6f35532">Highlight (yellow) - Page 3 · Location 200</h4>
<div class="outline-text-4" id="text-org6f35532">
<blockquote>
<p>
Modern <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">systems</a> theory , bound up with computers and equations , hides the fact that it traffics in truths known at some level by everyone . It is often possible , therefore , to make a direct translation from systems jargon to traditional wisdom .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org621f6a0" class="outline-4">
<h4 id="org621f6a0">Highlight (yellow) - Page 4 · Location 218</h4>
<div class="outline-text-4" id="text-org621f6a0">
<blockquote>
<p>
Hunger , poverty , environmental degradation , economic instability , unemployment , chronic disease , drug addiction , and war ,<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org4cdabee" class="outline-4">
<h4 id="org4cdabee">Highlight (yellow) - Page 4 · Location 220</h4>
<div class="outline-text-4" id="text-org4cdabee">
<blockquote>
<p>
are intrinsically <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">systems</a> problems — undesirable behaviors characteristic of the system structures that produce them . They will yield only as we reclaim our intuition , stop casting blame , see the system as the source of its own problems , and find the courage and wisdom to restructure it .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org45793ec" class="outline-4">
<h4 id="org45793ec">Highlight (yellow) - Page 6 · Location 260</h4>
<div class="outline-text-4" id="text-org45793ec">
<blockquote>
<p>
I don’t think the <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">systems</a> way of seeing is better than the reductionist way of thinking . I think it’s complementary , and therefore revealing . You can see some things through the lens of the human eye , other things through the lens of a microscope , others through the lens of a telescope , and still others through the lens of systems theory . Everything seen through each kind of lens is actually there . Each way of seeing allows our knowledge of the wondrous world in which we live to become a little more complete .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orga0b4d75" class="outline-4">
<h4 id="orga0b4d75">Highlight (yellow) - Page 7 · Location 282</h4>
<div class="outline-text-4" id="text-orga0b4d75">
<blockquote>
<p>
a simple lesson but one that we often ignore : The behavior of a <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">system</a> cannot be known just by knowing the elements of which the system is made .<br />
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org33d5b65" class="outline-3">
<h3 id="org33d5b65">Part One: System Structure and Behavior</h3>
<div class="outline-text-3" id="text-org33d5b65">
</div>
<div id="outline-container-org06e6a36" class="outline-4">
<h4 id="org06e6a36">Highlight (yellow) - One: The Basics &gt; Page 11 · Location 295</h4>
<div class="outline-text-4" id="text-org06e6a36">
<blockquote>
<p>
A <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">system</a> * is an interconnected set of elements that is coherently organized in a way that achieves something . If you look at that definition closely for a minute , you can see that a system must consist of three kinds of things : elements , interconnections , and a function or purpose .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgda6a1d5" class="outline-4">
<h4 id="orgda6a1d5">Highlight (yellow) - One: The Basics &gt; Page 12 · Location 311</h4>
<div class="outline-text-4" id="text-orgda6a1d5">
<blockquote>
<p>
Some people say that an old city neighborhood where people know each other and communicate regularly is a social <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">system</a> , and that a new apartment block full of strangers is not — not until new relationships arise and a system forms .<br />
</p>
</blockquote>
</div>
<ul class="org-ul">
<li><a id="orgf582621"></a>Note - One: The Basics &gt; Page 12 · Location 312<br />
<div class="outline-text-5" id="text-orgf582621">
<p>
+1 for living in an intentional community<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgcd7efe0" class="outline-4">
<h4 id="orgcd7efe0">Highlight (yellow) - One: The Basics &gt; Page 14 · Location 348</h4>
<div class="outline-text-4" id="text-orgcd7efe0">
<blockquote>
<p>
It’s easier to learn about a <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">system</a>’s elements than about its interconnections .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org41d3cdc" class="outline-4">
<h4 id="org41d3cdc">Highlight (yellow) - One: The Basics &gt; Page 14 · Location 353</h4>
<div class="outline-text-4" id="text-org41d3cdc">
<blockquote>
<p>
Information holds <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">systems</a> together and plays a great role in determining how they operate .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgb3acf7c" class="outline-4">
<h4 id="orgb3acf7c">Highlight (yellow) - One: The Basics &gt; Page 14 · Location 361</h4>
<div class="outline-text-4" id="text-orgb3acf7c">
<blockquote>
<p>
If information - based relationships are hard to see , functions or purposes are even harder . A <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">system</a>’s function or purpose is not necessarily spoken , written , or expressed explicitly , except through the operation of the system . The best way to deduce the system’s purpose is to watch for a while to see how the system behaves .<br />
</p>
</blockquote>
</div>
<ul class="org-ul">
<li><a id="orgb17fe45"></a>Note - One: The Basics &gt; Page 14 · Location 363<br />
<div class="outline-text-5" id="text-orgb17fe45">
<p>
system&rsquo;s purpose is what it does<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7737fbd" class="outline-4">
<h4 id="org7737fbd">Highlight (yellow) - One: The Basics &gt; Page 15 · Location 374</h4>
<div class="outline-text-4" id="text-org7737fbd">
<blockquote>
<p>
An important function of almost every <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">system</a> is to ensure its own perpetuation .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org732a2fd" class="outline-4">
<h4 id="org732a2fd">Highlight (yellow) - One: The Basics &gt; Page 16 · Location 389</h4>
<div class="outline-text-4" id="text-org732a2fd">
<blockquote>
<p>
Keeping sub - purposes and overall system purposes in harmony is an essential function of successful systems .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org7a393d3" class="outline-4">
<h4 id="org7a393d3">Highlight (yellow) - One: The Basics &gt; Page 16 · Location 392</h4>
<div class="outline-text-4" id="text-org7a393d3">
<blockquote>
<p>
Changing elements usually has the least effect on the system .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgcecbfef" class="outline-4">
<h4 id="orgcecbfef">Highlight (yellow) - One: The Basics &gt; Page 16 · Location 401</h4>
<div class="outline-text-4" id="text-orgcecbfef">
<blockquote>
<p>
If the interconnections change , the system may be greatly altered .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org2469e41" class="outline-4">
<h4 id="org2469e41">Highlight (yellow) - One: The Basics &gt; Page 16 · Location 406</h4>
<div class="outline-text-4" id="text-org2469e41">
<blockquote>
<p>
Changes in function or purpose also can be drastic<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgd149c16" class="outline-4">
<h4 id="orgd149c16">Highlight (yellow) - One: The Basics &gt; Page 17 · Location 426</h4>
<div class="outline-text-4" id="text-orgd149c16">
<blockquote>
<p>
A <a href="stock.html#ID-25743740-d3dc-4902-8b55-774c90a8c5f3">stock</a> is the foundation of any system . Stocks are the elements of the system that you can see , feel , count , or measure at any given time .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgaefd00f" class="outline-4">
<h4 id="orgaefd00f">Highlight (yellow) - One: The Basics &gt; Page 18 · Location 432</h4>
<div class="outline-text-4" id="text-orgaefd00f">
<blockquote>
<p>
<a href="stock.html#ID-25743740-d3dc-4902-8b55-774c90a8c5f3">Stocks</a> change over time through the actions of a <a href="flow.html#ID-4aeedf0a-efc6-44fe-acb3-4f5ee160fb2a">flow</a> . Flows are filling and draining , births and deaths , purchases and sales , growth and decay , deposits and withdrawals , successes and failures .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org8837eee" class="outline-4">
<h4 id="org8837eee">Highlight (yellow) - One: The Basics &gt; Page 22 · Location 495</h4>
<div class="outline-text-4" id="text-org8837eee">
<blockquote>
<p>
A <a href="stock.html#ID-25743740-d3dc-4902-8b55-774c90a8c5f3">stock</a> can be increased by decreasing its outflow rate as well as by increasing its inflow rate .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org7ac1488" class="outline-4">
<h4 id="org7ac1488">Highlight (yellow) - One: The Basics &gt; Page 23 · Location 503</h4>
<div class="outline-text-4" id="text-org7ac1488">
<blockquote>
<p>
A <a href="stock.html#ID-25743740-d3dc-4902-8b55-774c90a8c5f3">stock</a> takes time to change , because <a href="flow.html#ID-4aeedf0a-efc6-44fe-acb3-4f5ee160fb2a">flows</a> take time to flow . That’s a vital point , a key to understanding why systems behave as they do . Stocks usually change slowly .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orga1117e5" class="outline-4">
<h4 id="orga1117e5">Highlight (yellow) - One: The Basics &gt; Page 23 · Location 514</h4>
<div class="outline-text-4" id="text-orga1117e5">
<blockquote>
<p>
Changes in stocks set the pace of the dynamics of systems .<br />
</p>
</blockquote>
</div>
<ul class="org-ul">
<li><a id="org85c9adc"></a>Note - One: The Basics &gt; Page 23 · Location 514<br />
<div class="outline-text-5" id="text-org85c9adc">
<p>
Interesting that this rhymes with Beer talking about stable vs. unstable systems &#x2013; will the wave crash too fast before it can be managed / homeostasis-ed?<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgdc38b18" class="outline-4">
<h4 id="orgdc38b18">Highlight (yellow) - One: The Basics &gt; Page 24 · Location 526</h4>
<div class="outline-text-4" id="text-orgdc38b18">
<blockquote>
<p>
Stocks allow inflows and outflows to be decoupled and to be independent and temporarily out of balance with each other .<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org4585452" class="outline-4">
<h4 id="org4585452">Highlight (yellow) - One: The Basics &gt; Page 25 · Location 543</h4>
<div class="outline-text-4" id="text-org4585452">
<blockquote>
<p>
Systems thinkers see the world as a collection of stocks along with the mechanisms for regulating the levels in the stocks by manipulating flows . That means system thinkers see the world as a collection of “ feedback processes . ”<br />
</p>
</blockquote>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer style="font-size: 0.75rem;">
    <p>Made with <span class="heart">♥</span> using
        <a href="https://orgmode.org/">org-mode</a>.
        Source code is available
        <a href="https://github.com/ketan0/digital-laboratory">here</a>.
    </p>
</footer>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js"></script>
<script src="setup-theme-switcher.js"></script>
<script src="insert-intext-citation.js"></script>
</div>
</body>
</html>